Tekla.Structures.DialogInternal.NativeDialogOwner
For internal use only !
Class to handle native dialog instance

Tekla.Structures.DialogInternal.NativeDialogOwner.nativeDialogHandle
Handle to native dialog

Tekla.Structures.DialogInternal.NativeDialogOwner.disposedValue
Flag to prevent redundant disposing

Tekla.Structures.DialogInternal.NativeDialogOwner.#ctor(System.IntPtr)
Construct instance to hold the native dialog handle
nativeDialogHandle: Handle to native dialog

Tekla.Structures.DialogInternal.NativeDialogOwner.OnValueChanged(System.Object)
Event handler for passing generic catalog data back to dialog
data: value data

Tekla.Structures.DialogInternal.NativeDialogOwner.Finalize
Finalizes this instance

Tekla.Structures.DialogInternal.NativeDialogOwner.Dispose
Dispose all resources